package javaLab;
//"Код Да Винчи
//        Вывести на экран N чисел Фибоначчи.
//        Числа Фибоначчи - это ряд таких чисел, который начинается с 1 и 1 и затем каждое следующее число
//        равно сумме двух предыдущих.
//        Начало последовательности выглядит так: 1, 1, 2, 3, 5, 8, 13, 21, 34,
//        Число N вводится пользователем с клавиатуры.
//        Программа должна достаточно быстро работать для подсчета 500 чисел Фибоначчи.
//        Алгоритм не должен использовать рекурсию."

import java.util.Scanner;

public class Task12 {
    public static void main(String[] args) {
        int first = 1;
        int second = 1;

        System.out.println("Введите N-ое число Фибоначчи: ");
        Scanner scanner = new Scanner(System.in);

    }


}
